# Câu 25. Cho 2 số M và N thoả mãn điều kiện: 1<=N<=10000;
# 2<M<=100; Hãy viết chương trình xác định xem số N có thể được
#  phân tích thành tổng của M số nguyên tố hay không? Nếu có thì
#  in ra các số đó.
# Ví dụ: N=10 và M=3, thì 10=2+3+5 do đó kết quả trả về là thoả
# 2+3 = 5
# 2+3+5+7 = 17
# 2+3+5+7+11 = 28
# 2+3+5+7+11+13 = 41
# 2+3+5+7+11+13+17 = 58
# 2+3+5+7+11+13+17+19 = 77
# 2+3+5+7+11+13+17+19+23 = 100
# 2+3+5+7+11+13+17+19+23+29 = 129
# 2+3+5+7+11+13+17+19+23+29+31 = 160
# 2+3+5+7+11+13+17+19+23+29+31+37 = 197
# 2+3+5+7+11+13+17+19+23+29+31+37+41 = 238
# 2+5 = 7
# 2+5+7 = 14
# 2+5+7+11 = 25
# 2+5+7+11+13 = 38
# 2+5+7+11+13+17 = 57
# 2+5+7+11+13+17+19 = 76
# 2+5+7+11+13+17+19+23 = 99
# 2+5+7+11+13+17+19+23+29 = 128
# 2+5+7+11+13+17+19+23+29+31 = 159
# 2+5+7+11+13+17+19+23+29+31+37 = 196
# mãn và in ra 3 số 2,3,5

def isPrime(n):
    if n < 2:
        return False
    for item in range(2, n):
        if n % item == 0:
            print(item)
            return False
    return True
